test/xml/request_verified.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header></soapenv:Header><soapenv:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="ID-B862677E7F972AA9CAAB"><mpay:GetOrderDetails xmlns:mpay="https://mpay.gov.md/"><mpay:query><mpay:OrderKey>3BEEA3B3-B2C3-46AC-96F4-44FC4DAA9AED</mpay:OrderKey><mpay:ServiceID>MPaySampleService</mpay:ServiceID><mpay:Language>ro</mpay:Language></mpay:query></mpay:GetOrderDetails></soapenv:Body></soapenv:Envelope>